[Survived] BooleanLiteral
src/modules/tasks/routes.ts:11:7
  * Normalizes query value into a string array.
  */
 function normalizeArray(value: unknown): string[] | undefined {
-  if (!value) {
+  if (value) {
     return undefined;
   }

[Survived] ConditionalExpression
src/modules/tasks/routes.ts:11:7
  * Normalizes query value into a string array.
  */
 function normalizeArray(value: unknown): string[] | undefined {
-  if (!value) {
+  if (false) {
     return undefined;
   }

[Survived] ArrayDeclaration
src/modules/tasks/routes.ts:19:10
     return value as string[];
   }
 
-  return [String(value)];
+  return [];
 }
 

[Survived] BlockStatement
src/modules/tasks/routes.ts:29:73
 
 taskRouter.use(requireAuth);
 
-taskRouter.get("/", validateQuery(taskQuerySchema), async (req, res) => {
-  const parsedQuery = taskQuerySchema.parse(req.query) as TaskQueryInput;
-
-  const tasks = await listUserTasks(req.user!.userId, {
-    status: normalizeArray(parsedQuery.status) as never,
-    category: normalizeArray(parsedQuery.category) as never,
-    priority: normalizeArray(parsedQuery.priority) as never,
-    dueFrom: parsedQuery.dueFrom,
-    dueTo: parsedQuery.dueTo,
-    q: parsedQuery.q,
-  });
-
-  res.json({
-    data: tasks,
-    meta: {
-      total: tasks.length,
-      filtersApplied: req.query,
-    },
-  });
-});
+taskRouter.get("/", validateQuery(taskQuerySchema), async (req, res) => {});
 
 taskRouter.post("/", validateBody(createTaskSchema), async (req, res) => {

[Survived] ObjectLiteral
src/modules/tasks/routes.ts:41:12
     q: parsedQuery.q,
   });
 
-  res.json({
-    data: tasks,
-    meta: {
-      total: tasks.length,
-      filtersApplied: req.query,
-    },
-  });
+  res.json({});
 });
 

[Survived] BlockStatement
src/modules/tasks/routes.ts:50:74
   });
 });
 
-taskRouter.post("/", validateBody(createTaskSchema), async (req, res) => {
-  const result = await createUserTask(req.user!.userId, req.body);
-
-  res.status(201).json({
-    data: result.task,
-    warning: result.warning,
-  });
-});
+taskRouter.post("/", validateBody(createTaskSchema), async (req, res) => {});
 
 taskRouter.patch("/:taskId", validateBody(patchTaskSchema), async (req, res) => {

[Survived] ObjectLiteral
src/modules/tasks/routes.ts:53:24
 taskRouter.post("/", validateBody(createTaskSchema), async (req, res) => {
   const result = await createUserTask(req.user!.userId, req.body);
 
-  res.status(201).json({
-    data: result.task,
-    warning: result.warning,
-  });
+  res.status(201).json({});
 });
 

[Survived] BlockStatement
src/modules/tasks/routes.ts:59:81
   });
 });
 
-taskRouter.patch("/:taskId", validateBody(patchTaskSchema), async (req, res) => {
-  const taskIdRaw = req.params.taskId;
-  const taskId = Array.isArray(taskIdRaw) ? taskIdRaw[0] : taskIdRaw;
-
-  if (!taskId) {
-    res.status(400).json({
-      error: {
-        code: "HTTP_400",
-        message: "Missing task id.",
-      },
-    });
-    return;
-  }
-
-  const result = await updateUserTask(req.user!.userId, taskId, req.body);
-
-  res.json({
-    data: result.task,
-    warning: result.warning,
-  });
-});
+taskRouter.patch("/:taskId", validateBody(patchTaskSchema), async (req, res) => {});
 
 taskRouter.delete("/:taskId", async (req, res) => {

[NoCoverage] ObjectLiteral
src/modules/tasks/routes.ts:65:14
 
   if (!taskId) {
     res.status(400).json({
-      error: {
-        code: "HTTP_400",
-        message: "Missing task id.",
-      },
+      error: {},
     });
     return;

[NoCoverage] StringLiteral
src/modules/tasks/routes.ts:67:18
     res.status(400).json({
       error: {
         code: "HTTP_400",
-        message: "Missing task id.",
+        message: "",
       },
     });

[Survived] BlockStatement
src/modules/tasks/routes.ts:81:51
   });
 });
 
-taskRouter.delete("/:taskId", async (req, res) => {
-  const taskIdRaw = req.params.taskId;
-  const taskId = Array.isArray(taskIdRaw) ? taskIdRaw[0] : taskIdRaw;
-
-  if (!taskId) {
-    res.status(400).json({
-      error: {
-        code: "HTTP_400",
-        message: "Missing task id.",
-      },
-    });
-    return;
-  }
-
-  await deleteUserTask(req.user!.userId, taskId);
-  res.status(204).send();
-});
+taskRouter.delete("/:taskId", async (req, res) => {});
 

[Survived] ConditionalExpression
src/modules/tasks/routes.ts:85:7
   const taskIdRaw = req.params.taskId;
   const taskId = Array.isArray(taskIdRaw) ? taskIdRaw[0] : taskIdRaw;
 
-  if (!taskId) {
+  if (true) {
     res.status(400).json({
       error: {

[Survived] ConditionalExpression
src/modules/tasks/routes.ts:85:7
   const taskIdRaw = req.params.taskId;
   const taskId = Array.isArray(taskIdRaw) ? taskIdRaw[0] : taskIdRaw;
 
-  if (!taskId) {
+  if (false) {
     res.status(400).json({
       error: {

[NoCoverage] StringLiteral
src/modules/tasks/routes.ts:88:15
   if (!taskId) {
     res.status(400).json({
       error: {
-        code: "HTTP_400",
+        code: "",
         message: "Missing task id.",
       },
