[Survived] BlockStatement
src/modules/auth/routes.ts:11:80
  */
 export const authRouter = Router();
 
-authRouter.post("/register", validateBody(registerSchema), async (req, res) => {
-  const result = await registerUser(req.body);
-
-  res.status(201).json({
-    data: {
-      userId: result.user.userId,
-      email: result.user.email,
-      displayName: result.user.displayName,
-      createdAt: result.user.createdAt,
-    },
-    meta: {
-      tokenType: result.tokenType,
-      expiresIn: result.expiresIn,
-      accessToken: result.accessToken,
-    },
-  });
-});
+authRouter.post("/register", validateBody(registerSchema), async (req, res) => {});
 
 authRouter.post("/login", validateBody(loginSchema), async (req, res) => {

[Survived] ObjectLiteral
src/modules/auth/routes.ts:15:11
   const result = await registerUser(req.body);
 
   res.status(201).json({
-    data: {
-      userId: result.user.userId,
-      email: result.user.email,
-      displayName: result.user.displayName,
-      createdAt: result.user.createdAt,
-    },
+    data: {},
     meta: {
       tokenType: result.tokenType,

[Survived] BlockStatement
src/modules/auth/routes.ts:29:74
   });
 });
 
-authRouter.post("/login", validateBody(loginSchema), async (req, res) => {
-  const result = await loginUser(req.body);
-
-  res.json({
-    data: {
-      accessToken: result.accessToken,
-      tokenType: result.tokenType,
-      expiresIn: result.expiresIn,
-      user: result.user,
-    },
-  });
-});
+authRouter.post("/login", validateBody(loginSchema), async (req, res) => {});
 
 authRouter.post("/logout", (_req, res) => {

[Survived] ObjectLiteral
src/modules/auth/routes.ts:32:12
 authRouter.post("/login", validateBody(loginSchema), async (req, res) => {
   const result = await loginUser(req.body);
 
-  res.json({
-    data: {
-      accessToken: result.accessToken,
-      tokenType: result.tokenType,
-      expiresIn: result.expiresIn,
-      user: result.user,
-    },
-  });
+  res.json({});
 });
 

[Survived] ObjectLiteral
src/modules/auth/routes.ts:33:11
   const result = await loginUser(req.body);
 
   res.json({
-    data: {
-      accessToken: result.accessToken,
-      tokenType: result.tokenType,
-      expiresIn: result.expiresIn,
-      user: result.user,
-    },
+    data: {},
   });
 });

[Survived] BlockStatement
src/modules/auth/routes.ts:42:43
   });
 });
 
-authRouter.post("/logout", (_req, res) => {
-  res.status(204).send();
-});
+authRouter.post("/logout", (_req, res) => {});
 
