[Killed] BlockStatement
src/services/auth-service.ts:21:17
 }> {
   const existing = await findUserByEmail(input.email);
 
-  if (existing) {
-    throw new HttpError(409, "Email is already registered.");
-  }
+  if (existing) {}
 
   const passwordHash = await hashPassword(input.password, env.bcryptSaltRounds);
killedBy: auth-service should reject registration when email is already registered
statusReason: Error: expect(received).rejects.toEqual(expected) // deep equality

Expected: [Error: Email is already registered.]
Received: [TypeError: Cannot read properties of undefined (reading 'userId')]

[Killed] BlockStatement
src/services/auth-service.ts:68:25
 
   const isValidPassword = await verifyPassword(input.password, user.passwordHash);
 
-  if (!isValidPassword) {
-    throw new HttpError(401, "Invalid email or password.");
-  }
+  if (!isValidPassword) {}
 
   const accessToken = signAuthToken({
killedBy: auth-service should reject login when password is invalid
statusReason: Error: expect(received).rejects.toEqual()

Received promise resolved instead of rejected
Resolved to value: {"accessToken": undefined, "expiresIn": "1h", "tokenType": "Bearer", "user": {"displayName": "Valid User", "email": "valid@example.com", "userId": "u-3"}}

[Killed] BooleanLiteral
src/services/auth-service.ts:68:7
 
   const isValidPassword = await verifyPassword(input.password, user.passwordHash);
 
-  if (!isValidPassword) {
+  if (isValidPassword) {
     throw new HttpError(401, "Invalid email or password.");
   }
killedBy: auth-service should reject login when password is invalid
statusReason: Error: expect(received).rejects.toEqual()

Received promise resolved instead of rejected
Resolved to value: {"accessToken": undefined, "expiresIn": "1h", "tokenType": "Bearer", "user": {"displayName": "Valid User", "email": "valid@example.com", "userId": "u-3"}}
