[Killed] ConditionalExpression
src/services/task-service.ts:19:5
   warning?: string;
 }> {
   const dueDateWarning =
-    input.dueDate && new Date(input.dueDate).getTime() < Date.now()
+    true
       ? "Due date is in the past."
       : undefined;
killedBy: task-service should create a task with default values and no warning for future due date
statusReason: Error: expect(received).toBeUndefined()

Received: "Due date is in the past."

[Killed] ConditionalExpression
src/services/task-service.ts:19:22
   warning?: string;
 }> {
   const dueDateWarning =
-    input.dueDate && new Date(input.dueDate).getTime() < Date.now()
+    input.dueDate && true
       ? "Due date is in the past."
       : undefined;
killedBy: task-service should create a task with default values and no warning for future due date
statusReason: Error: expect(received).toBeUndefined()

Received: "Due date is in the past."

[Killed] StringLiteral
src/services/task-service.ts:20:9
 }> {
   const dueDateWarning =
     input.dueDate && new Date(input.dueDate).getTime() < Date.now()
-      ? "Due date is in the past."
+      ? ""
       : undefined;
 
killedBy: task-service should warn when due date is just before now (boundary)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Due date is in the past."
Received: undefined

[Killed] StringLiteral
src/services/task-service.ts:27:29
     userId,
     title: input.title,
     description: input.description,
-    status: input.status ?? "to-do",
+    status: input.status ?? "",
     category: input.category ?? "other",
     priority: input.priority ?? "medium",
killedBy: task-service should create a task with default values and no warning for future due date
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "category": "other",
    "description": "Set up fixtures",

[Killed] BlockStatement
src/services/task-service.ts:33:23
     dueDate: input.dueDate,
   });
 
-  if (dueDateWarning) {
-    return { task, warning: dueDateWarning };
-  }
+  if (dueDateWarning) {}
 
   return { task };
killedBy: task-service should warn when due date is just before now (boundary)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Due date is in the past."
Received: undefined

[Killed] ConditionalExpression
src/services/task-service.ts:33:7
     dueDate: input.dueDate,
   });
 
-  if (dueDateWarning) {
+  if (false) {
     return { task, warning: dueDateWarning };
   }
killedBy: task-service should warn when due date is just before now (boundary)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Due date is in the past."
Received: undefined

[Killed] ConditionalExpression
src/services/task-service.ts:49:5
   input: PatchTaskInput,
 ): Promise<{ task: NonNullable<Awaited<ReturnType<typeof updateTask>>>; warning?: string }> {
   const dueDateWarning =
-    input.dueDate && new Date(input.dueDate).getTime() < Date.now()
+    false
       ? "Due date is in the past."
       : undefined;
killedBy: task-service should update task and include warning when due date is in the past
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Due date is in the past."
Received: undefined

[Killed] EqualityOperator
src/services/task-service.ts:49:22
   input: PatchTaskInput,
 ): Promise<{ task: NonNullable<Awaited<ReturnType<typeof updateTask>>>; warning?: string }> {
   const dueDateWarning =
-    input.dueDate && new Date(input.dueDate).getTime() < Date.now()
+    input.dueDate && new Date(input.dueDate).getTime() >= Date.now()
       ? "Due date is in the past."
       : undefined;
killedBy: task-service should update task and include warning when due date is in the past
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Due date is in the past."
Received: undefined

[Killed] ObjectLiteral
src/services/task-service.ts:53:49
       ? "Due date is in the past."
       : undefined;
 
-  const task = await updateTask(taskId, userId, {
-    title: input.title,
-    description: input.description,
-    status: input.status,
-    category: input.category,
-    priority: input.priority,
-    dueDate: input.dueDate,
-  });
+  const task = await updateTask(taskId, userId, {});
 
   if (!task) {
killedBy: task-service should update task and include warning when due date is in the past
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "t-3",
  "u-1",
- Object {

[Killed] StringLiteral
src/services/task-service.ts:63:30
   });
 
   if (!task) {
-    throw new HttpError(404, "Task not found.");
+    throw new HttpError(404, "");
   }
 
killedBy: task-service should throw 404 when updating a task that does not exist
statusReason: Error: expect(received).rejects.toEqual(expected) // deep equality

Expected: [Error: Task not found.]
Received: [Error]

[Killed] BlockStatement
src/services/task-service.ts:76:85
 /**
  * Deletes a task by id and owner.
  */
-export async function deleteUserTask(userId: string, taskId: string): Promise<void> {
-  const deleted = await deleteTask(taskId, userId);
-
-  if (!deleted) {
-    throw new HttpError(404, "Task not found.");
-  }
-}
+export async function deleteUserTask(userId: string, taskId: string): Promise<void> {}
 
 /**
killedBy: task-service should throw 404 when deleting a non-existing task
statusReason: Error: expect(received).rejects.toEqual()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/services/task-service.ts:79:17
 export async function deleteUserTask(userId: string, taskId: string): Promise<void> {
   const deleted = await deleteTask(taskId, userId);
 
-  if (!deleted) {
-    throw new HttpError(404, "Task not found.");
-  }
+  if (!deleted) {}
 }
 
killedBy: task-service should throw 404 when deleting a non-existing task
statusReason: Error: expect(received).rejects.toEqual()

Received promise resolved instead of rejected
Resolved to value: undefined
